## **Program to extract the pincode of places in banglore for finding bounding box for each pincode**

In [0]:
import pandas as pd

CSV file downloaded from the website ( [link](https://data.gov.in/ ))

In [0]:
df=pd.read_csv("PINCODE.csv", encoding = "ISO-8859-1")

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 906267 entries, 0 to 906266
Data columns (total 6 columns):
Village/Locality name     906267 non-null object
Officename ( BO/SO/HO)    906267 non-null object
Pincode                   906267 non-null int64
Sub-distname              906267 non-null object
Districtname              906267 non-null object
StateName                 906267 non-null object
dtypes: int64(1), object(5)
memory usage: 24.2+ MB

In [0]:
df.head(1)

,Village/Locality name,Officename ( BO/SO/HO),Pincode,Sub-distname,Districtname,StateName
0,Aliganj,Lodi Road H.O,110003,Defence Colony,SOUTH EAST DELHI,DELHI

extracting data pertaining to Bangalore and Bangalore Rural

In [0]:
df1=df[(df.Districtname == "BANGALORE") | (df.Districtname == "BANGALORE RURAL")]

In [0]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1995 entries, 517731 to 522137
Data columns (total 6 columns):
Village/Locality name     1995 non-null object
Officename ( BO/SO/HO)    1995 non-null object
Pincode                   1995 non-null int64
Sub-distname              1995 non-null object
Districtname              1995 non-null object
StateName                 1995 non-null object
dtypes: int64(1), object(5)
memory usage: 70.1+ KB

In [0]:
df1.head()

,Village/Locality name,Officename ( BO/SO/HO),Pincode,Sub-distname,Districtname,StateName
517731,Bangalore North,Vidhana Soudha S.O,560001,Bangalore North,BANGALORE,KARNATAKA
517732,Bangalore North,HighCourt S.O,560001,Bangalore North,BANGALORE,KARNATAKA
517733,Bangalore North,Dr. Ambedkar Veedhi S.O,560001,Bangalore North,BANGALORE,KARNATAKA
517734,Bangalore North,Legislators Home S.O,560001,Bangalore North,BANGALORE,KARNATAKA
517735,Bangalore North,Rajbhavan S.O (Bangalore),560001,Bangalore North,BANGALORE,KARNATAKA

In [0]:
import numpy as np

In [0]:
df1.insert(2, "latitude", np.nan)

In [0]:
df1.insert(3, "longitude", np.nan)

In [0]:
df1.head()

,Village/Locality name,Officename ( BO/SO/HO),latitude,longitude,Pincode,Sub-distname,Districtname,StateName
517731,Bangalore North,Vidhana Soudha S.O,NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA
517732,Bangalore North,HighCourt S.O,NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA
517733,Bangalore North,Dr. Ambedkar Veedhi S.O,NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA
517734,Bangalore North,Legislators Home S.O,NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA
517735,Bangalore North,Rajbhavan S.O (Bangalore),NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA

In [0]:
df1.to_csv("test.csv")

**We now have a list of places in Banglore along with their details.**

In [0]:
s=pd.read_csv("test.csv")

In [0]:
s.head()

,Unnamed: 0,Village/Locality name,Officename ( BO/SO/HO),latitude,longitude,Pincode,Sub-distname,Districtname,StateName
0,517731,Bangalore North,Vidhana Soudha S.O,NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA
1,517732,Bangalore North,HighCourt S.O,NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA
2,517733,Bangalore North,Dr. Ambedkar Veedhi S.O,NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA
3,517734,Bangalore North,Legislators Home S.O,NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA
4,517735,Bangalore North,Rajbhavan S.O (Bangalore),NaN,NaN,560001,Bangalore North,BANGALORE,KARNATAKA

In [0]:
s=s.drop_duplicates("Pincode")

In [0]:
s1=s.loc[:,["Pincode","latitude","longitude"]]

In [0]:
s1.head()

    Pincode  latitude  longitude
0    560001       NaN        NaN
8    560002       NaN        NaN
10   560003       NaN        NaN
14   560004       NaN        NaN
18   560005       NaN        NaN

In [0]:
s1=s1.reset_index()

In [0]:
s1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 4 columns):
index        132 non-null int64
Pincode      132 non-null int64
latitude     0 non-null float64
longitude    0 non-null float64
dtypes: float64(2), int64(2)
memory usage: 4.2 KB

In [0]:
s1=s1.drop(["index"],axis=1)

In [0]:
s1.head(1)

   Pincode  latitude  longitude  BB_lat_1  BB_lat_2  BB_lon_1  BB_lon_2
0   560001       NaN        NaN       NaN       NaN       NaN       NaN

In [0]:
s1.insert(4, "BB_lat_1", np.nan)

In [0]:
s1.insert(5, "BB_lat_2", np.nan)

In [0]:
s1.insert(6, "BB_lon_1", np.nan)

In [0]:
s1.insert(7, "BB_lon_2", np.nan)

In [0]:
s1.head()

   Pincode  latitude  longitude  BB_lat_1  BB_lat_2  BB_lon_1  BB_lon_2
0   560001       NaN        NaN       NaN       NaN       NaN       NaN
1   560002       NaN        NaN       NaN       NaN       NaN       NaN
2   560003       NaN        NaN       NaN       NaN       NaN       NaN
3   560004       NaN        NaN       NaN       NaN       NaN       NaN
4   560005       NaN        NaN       NaN       NaN       NaN       NaN

In [0]:
s1.to_csv("all_pincodes_box_co.csv")

## **The final list contains all the unique pincodes in Banglore.**